using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class HomeScene_Deta 
{
    public static readonly string[] ghostSpeechTexts = { "やっと来たわね。\n行くわよ。", "こうなる前？\nしらないわ、興味もないし。\nあなたに話したくない。", "好きなもの？\nなに急に、気持ち悪い。まぁいいわ。\nあえて言うなら人間の断末魔を\n聞くこと…かしらね。", "嫌いなもの？\nそうね。\n私に気軽に話しかける\nあなたみたいなやつとか？", "悩み？\nそんなものないわ。\nいいから話しかけないで。" };
    public static readonly string[] zasikiwarasiSpeechTexts = { "あら？遅かったのね。\n待ちくたびれたわ。", "好きなこと？\n人形とおしゃべりすることぐらいよ。\nそれ以外は特にないわ。", "きらいなもの？\n人間よ。\nあら？黙ってどうしたの？", "悩みなんてないわ。", "興味があるもの？\nそうね。\n西洋のお人形さんに\n今は少し興味があるかしら。" };
    public static readonly string[] oniSpeechTexts = { "来たか。\n勤勉だな。", "義は全てに通ずる道理だ。\n義に忠実であることは\n何者にも勝る美徳だ。", "義に背く者、\n正しき道から逸れた者、\n欲に溺れるは唾棄すべき邪悪だ", "昨今の人間の在り様は\nよからぬものだ。\n正さねばなるまい。", "義は全てに通ずる道理だ。\n義に忠実であることは\n何者にも勝る美徳だ。" };
    public static readonly string[] poltergeistSpeechTexts = { "こんにちは…\n今日も行きますか？", "私が好きなものですか？\n熊のテディが好きです。\n私の家族です。", "嫌いなものですか？\n怖いものが嫌いです。\nあと声が大きい人も…。", "悩みですか？\n友達が欲しいです…。", "ずっとお家にいました。\nお母さんお父さんといっしょだったのに\nいつの間にかいなかったんです…\nごめんなさい忘れてください。" };
    public static readonly string[] demonSpeechTexts = { "シシッ。\n待っていたよ。\n寝ちゃうところだったよ。", "僕の好きなもの？\nシシッ。\n蟲さんが大好きなんだ。\n蟲は絶対に裏切らないからね。", "まぁ君のことは少し気に入っているよ…。\nごめんわすれて。", "僕は蟲さん以外大嫌いだよ。\nみんななに考えてるかわからない。", "最近蟲さんの調子が\n悪いみたいなんだ。\n大丈夫かな？" };
}
